tap "artginzburg/tap"
tap "bensadeh/circumflex"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "noahgorstein/tap"
tap "rhyeal/aws-rotate-iam-keys", "https://github.com/rhyeal/aws-rotate-iam-keys"
brew "awscli"
brew "awscurl"
brew "bash"
brew "bitwarden-cli"
brew "black"
brew "chafa"
brew "clang-format"
brew "cmatrix"
brew "colordiff"
brew "coreutils"
brew "difftastic"
brew "docker", link: false
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "eksctl"
brew "findutils"
brew "gifski"
brew "git-delta"
brew "gitleaks"
brew "pinentry"
brew "gnupg"
brew "go"
brew "graphviz"
brew "helm"
brew "howdoi"
brew "htop"
brew "httpie"
brew "icdiff"
brew "imagemagick"
brew "isort"
brew "jq"
brew "jsonnet"
brew "kind"
brew "kubernetes-cli"
brew "less"
brew "lesspipe"
brew "lf"
brew "mas"
brew "mysql"
brew "neovim"
brew "nmap"
brew "nnn"
brew "pdf2image"
brew "podman"
brew "postgresql@14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "redis"
brew "skaffold"
brew "slides"
brew "subversion"
brew "tldr"
brew "tmux"
brew "tree"
brew "ttyd"
brew "vale"
brew "watch"
brew "wget"
brew "artginzburg/tap/sudo-touchid"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "noahgorstein/tap/jqp"
cask "appcleaner"
cask "arc"
cask "authy"
cask "bartender"
cask "cloudflare-warp"
cask "cron"
cask "discord"
cask "discord-canary"
cask "docker"
cask "firefox-beta"
cask "flameshot"
cask "gitify"
cask "google-chrome-beta"
cask "itsycal"
cask "jellyfin-media-player"
cask "karabiner-elements"
cask "kitty"
cask "lunar"
cask "mullvad-browser"
cask "mullvadvpn-beta"
cask "obsidian"
cask "plex"
cask "raycast"
cask "scroll-reverser"
cask "shottr"
cask "slack-beta"
cask "spotify"
cask "there"
cask "todoist"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Endel", id: 1346247457
mas "Gifski", id: 1351639930
mas "Shareful", id: 1522267256
mas "UTC Time", id: 1538245904
vscode "13xforever.language-x86-64-assembly"
vscode "766b.go-outliner"
vscode "aaron-bond.better-comments"
vscode "af4jm.vscode-m3u"
vscode "akamud.vscode-theme-onelight"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.icons-carbon"
vscode "apvarun.celestial"
vscode "asvetliakov.vscode-neovim"
vscode "barrsan.reui"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "Bito.Bito"
vscode "bradymholt.pgformatter"
vscode "Catppuccin.catppuccin-vsc"
vscode "cdonohue.quill-icons"
vscode "christian-kohler.path-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "diff001a.kawaii-theme"
vscode "dlasagno.wal-theme"
vscode "dnlytras.nord-wave"
vscode "dunstontc.viml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "EliverLara.andromeda"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "eserozvataf.one-dark-pro-monokai-darker"
vscode "fabiospampinato.vscode-todo-plus"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.copilot-labs"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "guyskk.language-cython"
vscode "hashicorp.terraform"
vscode "hedinne.popping-and-locking-vscode"
vscode "humao.rest-client"
vscode "icrawl.discord-vscode"
vscode "James-Yu.latex-workshop"
vscode "jaredkent.laserwave"
vscode "jasonlhy.hungry-delete"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnpapa.vscode-peacock"
vscode "karyfoundation.theme-karyfoundation-themes"
vscode "KevinRose.vsc-python-indent"
vscode "L13RARY.l13-diff"
vscode "lehni.vscode-fix-checksums"
vscode "mammothb.scilab"
vscode "MaoSantaella.night-wolf"
vscode "merko.merko-green-theme"
vscode "metaseed.metago"
vscode "metaseed.MetaJump"
vscode "metaseed.MetaWord"
vscode "miguelsolorio.fluent-icons"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "mvllow.rose-pine"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "peymanslh.blueberry-dark-theme"
vscode "PKief.material-icon-theme"
vscode "PROxZIMA.sweetdracula"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "ritwickdey.LiveServer"
vscode "RobbOwen.synthwave-vscode"
vscode "rokoroku.vscode-theme-darcula"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.gruvbox-material"
vscode "sdras.inbedby7pm"
vscode "sdras.night-owl"
vscode "slevesque.shader"
vscode "sourcegraph.cody-ai"
vscode "ssmi.after-dark"
vscode "Stephanvs.dot"
vscode "teabyii.ayu"
vscode "tonsky.theme-alabaster"
vscode "uloco.theme-bluloco-light"
vscode "viktorqvarfordt.vscode-pitch-black-theme"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-pack"
vscode "vscodevim.vim"
vscode "wart.ariake-dark"
vscode "wayou.vscode-todo-highlight"
vscode "wheredoesyourmindgo.gruvbox-concoctis"
vscode "yzhang.markdown-all-in-one"
vscode "zanza00.random-theme-switcher"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
