tap "artginzburg/tap"
tap "aws/tap"
tap "bensadeh/circumflex"
tap "datawire/blackbird"
tap "dimentium/autoraise"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "noahgorstein/tap"
tap "rhyeal/aws-rotate-iam-keys", "https://github.com/rhyeal/aws-rotate-iam-keys"
brew "act"
brew "ansible"
brew "argo"
brew "argocd"
brew "atuin"
brew "awscli"
brew "awscurl"
brew "bash"
brew "bitwarden-cli"
brew "black"
brew "chafa"
brew "clang-format"
brew "cmatrix"
brew "colordiff"
brew "coreutils"
brew "difftastic"
brew "docker", link: false
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "eksctl"
brew "findutils"
brew "fluent-bit"
brew "gifski"
brew "git-delta"
brew "gitleaks"
brew "go"
brew "graphviz"
brew "helm"
brew "howdoi"
brew "htop"
brew "httpie"
brew "icdiff"
brew "imagemagick"
brew "isort"
brew "jq"
brew "jsonnet"
brew "kind"
brew "kubernetes-cli"
brew "kumactl"
brew "less"
brew "lesspipe"
brew "lf"
brew "mas"
brew "minikube"
brew "mysql"
brew "neovim"
brew "nmap"
brew "nnn"
brew "pdf2image"
brew "pinentry"
brew "podman"
brew "postgresql@14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.9"
brew "redis"
brew "skaffold"
brew "slides"
brew "subversion"
brew "tfenv"
brew "tldr"
brew "tmux"
brew "tree"
brew "ttyd"
brew "vale"
brew "velero"
brew "watch"
brew "wget"
brew "artginzburg/tap/sudo-touchid"
brew "aws/tap/aws-sam-cli"
brew "aws/tap/copilot-cli"
brew "datawire/blackbird/telepresence"
brew "dimentium/autoraise/autoraise"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "noahgorstein/tap/jqp"
cask "alt-tab"
cask "amethyst"
cask "appcleaner"
cask "authy"
cask "barrier"
cask "bartender"
cask "cloudflare-warp"
cask "cron"
cask "discord"
cask "discord-canary"
cask "docker"
cask "dozer"
cask "finicky"
cask "firefox"
cask "hammerspoon"
cask "itsycal"
cask "karabiner-elements"
cask "kitty"
cask "logseq"
cask "lunar"
cask "ngrok"
cask "obsidian"
cask "rancher"
cask "raycast"
cask "rocket"
cask "scroll-reverser"
cask "slack-beta"
cask "spotify"
cask "there"
cask "todoist"
cask "topnotch"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "wireshark"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Balance", id: 1637311725
mas "ColorSlurp", id: 1287239339
mas "Endel", id: 1484348796
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Ooooo", id: 1482773008
mas "Pages", id: 409201541
mas "Plash", id: 1494023538
mas "Shareful", id: 1522267256
mas "UTC Time", id: 1538245904
