tap "artginzburg/tap"
tap "buo/cask-upgrade"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "pyroscope-io/brew"
tap "rcmdnk/file"
# Official Amazon AWS command-line interface
brew "awscli"
# Curl like simplicity to access AWS resources
brew "awscurl"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Python code formatter
brew "black"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Validate EPUB files, version 2.0 and later
brew "epubcheck"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Audit git repos for secrets
brew "gitleaks"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go implementation of configuration language for defining JSON data
brew "go-jsonnet"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Sort Python imports automatically
brew "isort"
# Package manager for Jsonnet
brew "jsonnet-bundler"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Pager program similar to more
brew "less"
# Input filter for the pager less
brew "lesspipe"
# Terminal file manager
brew "lf"
# Command-line utility to interact with linkerd
brew "linkerd"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Port scanning utility for large networks
brew "nmap"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Convert PDFs to images
brew "pdf2image"
# Object-relational database system
brew "postgresql@14"
# Log agent for Loki
brew "promtail"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Implementation of Python 3 in Python
brew "pypy3.10"
# Persistent key-value database, with built-in net interface
brew "redis"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Terminal based presentation tool
brew "slides"
# Version control system designed to be a better CVS
brew "subversion"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Syntax-aware linter for prose
brew "vale"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Permanent TouchID support for sudo
brew "artginzburg/tap/sudo-touchid"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Open source continuous profiling software
brew "pyroscope-io/brew/profilecli"
# Password manager
cask "1password-beta"
# Command-line interface for 1Password
cask "1password-cli"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Menu bar icon organiser
cask "bartender"
# E-books management software
cask "calibre"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# Voice and text chat software
cask "discord-canary"
# Web browser
cask "firefox-beta"
# Screenshot software
cask "flameshot"
# GitHub Notifications on your menu bar
cask "gitify"
# Web browser
cask "google-chrome-beta"
# Jellyfin desktop client
cask "jellyfin-media-player"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customiser
cask "karabiner-elements"
# Interface for reading and syncing eBooks
cask "kindle"
# GPU-based terminal emulator
cask "kitty"
# Adaptive brightness for external displays
cask "lunar"
# Play mechanical keyboard sounds as you type
cask "mechvibes"
# Sandbox construction video game
cask "minecraft"
# Web browser focused on privacy and on minimizing tracking and fingerprinting
cask "mullvad-browser"
# VPN client
cask "mullvadvpn-beta"
# Calendar for professionals and teams
cask "notion-calendar"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Home media player
cask "plex"
# Archive manager for data compression and backups
cask "rar"
# Control your tools with a few keystrokes
cask "raycast"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack-beta"
# Music streaming service
cask "spotify"
# Tool to display the local times of people in a team
cask "there"
# To-do list
cask "todoist"
# Web browser focusing on security
cask "tor-browser"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Network protocol analyzer
cask "wireshark"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Endel", id: 1346247457
mas "Gifski", id: 1351639930
mas "Grila", id: 6444335028
mas "Numbers", id: 409203825
mas "Shareful", id: 1522267256
mas "UTC Time", id: 1538245904
vscode "13xforever.language-x86-64-assembly"
vscode "766b.go-outliner"
vscode "aaron-bond.better-comments"
vscode "af4jm.vscode-m3u"
vscode "akamud.vscode-theme-onelight"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.icons-carbon"
vscode "apvarun.celestial"
vscode "asvetliakov.vscode-neovim"
vscode "barrsan.reui"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bradymholt.pgformatter"
vscode "catppuccin.catppuccin-vsc"
vscode "cdonohue.quill-icons"
vscode "christian-kohler.path-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "diff001a.kawaii-theme"
vscode "dlasagno.wal-theme"
vscode "dnlytras.nord-wave"
vscode "dunstontc.viml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eliverlara.andromeda"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "eserozvataf.one-dark-pro-monokai-darker"
vscode "fabiospampinato.vscode-todo-plus"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "guyskk.language-cython"
vscode "hashicorp.terraform"
vscode "hedinne.popping-and-locking-vscode"
vscode "humao.rest-client"
vscode "icrawl.discord-vscode"
vscode "james-yu.latex-workshop"
vscode "jaredkent.laserwave"
vscode "jasonlhy.hungry-delete"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "johnpapa.vscode-peacock"
vscode "karyfoundation.theme-karyfoundation-themes"
vscode "kevinrose.vsc-python-indent"
vscode "l13rary.l13-diff"
vscode "lehni.vscode-fix-checksums"
vscode "mammothb.scilab"
vscode "maosantaella.night-wolf"
vscode "mechatroner.rainbow-csv"
vscode "merko.merko-green-theme"
vscode "metaseed.metago"
vscode "metaseed.metajump"
vscode "metaseed.metaword"
vscode "miguelsolorio.fluent-icons"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "mvllow.rose-pine"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "peymanslh.blueberry-dark-theme"
vscode "pkief.material-icon-theme"
vscode "proxzima.sweetdracula"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "rokoroku.vscode-theme-darcula"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.gruvbox-material"
vscode "sdras.inbedby7pm"
vscode "sdras.night-owl"
vscode "slevesque.shader"
vscode "sourcegraph.cody-ai"
vscode "ssmi.after-dark"
vscode "stephanvs.dot"
vscode "stkb.rewrap"
vscode "teabyii.ayu"
vscode "tonsky.theme-alabaster"
vscode "uloco.theme-bluloco-light"
vscode "viktorqvarfordt.vscode-pitch-black-theme"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-pack"
vscode "vscodevim.vim"
vscode "wart.ariake-dark"
vscode "wayou.vscode-todo-highlight"
vscode "wheredoesyourmindgo.gruvbox-concoctis"
vscode "yzhang.markdown-all-in-one"
vscode "zanza00.random-theme-switcher"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
