tap "artginzburg/tap"
tap "atlassian/acli"
tap "aws/tap"
tap "buo/cask-upgrade"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikolaeu/numi"
tap "oven-sh/bun"
tap "rcmdnk/file"
tap "rien7/apps"
tap "sst/tap"
# CLI tool for AWS Athena service
brew "athenacli"
# Official Amazon AWS command-line interface
brew "awscli"
# Curl like simplicity to access AWS resources
brew "awscurl"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Manage multiple AI agents like Claude Code, Aider and Codex in your terminal
brew "claude-squad"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Securely send things from one computer to another
brew "croc"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Utility for exporting data from Ente and decrypt the export from Ente Auth
brew "ente-cli"
# Validate EPUB files, version 2.0 and later
brew "epubcheck"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Package manager and build system for Fortran
brew "fpm"
# GNU awk utility
brew "gawk"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Highest-quality GIF encoder based on pngquant
brew "gifski"
# High-velocity, monorepo-scale workflow for Git
brew "git-branchless"
# Audit git repos for secrets
brew "gitleaks"
# GNU implementation of time utility
brew "gnu-time"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go implementation of configuration language for defining JSON data
brew "go-jsonnet"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# Like cURL, but for gRPC
brew "grpcurl"
# Kubernetes package manager
brew "helm"
# Create Helm chart from Kubernetes yaml
brew "helmify"
# Improved top (interactive process viewer)
brew "htop"
# Client library for huggingface.co hub
brew "huggingface-cli"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Terminal Client for Redis with AutoCompletion and Syntax Highlighting
brew "iredis"
# Sort Python imports automatically
brew "isort"
# Command-line note taker
brew "jrnl"
# Package manager for Jsonnet
brew "jsonnet-bundler"
# Handy way to save and run project-specific commands
brew "just"
# CLI for managing Apache Kafka
brew "kafkactl"
# Generic command-line non-JVM Apache Kafka producer and consumer
brew "kcat"
# VPN kill switch for macOS
brew "killswitch"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# API Traffic Analyzer providing real-time visibility into Kubernetes network
brew "kubeshark"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Pager program similar to more
brew "less"
# Input filter for the pager less
brew "lesspipe"
# Terminal file manager
brew "lf"
# Sophisticated file transfer program
brew "lftp"
# Command-line utility to interact with linkerd
brew "linkerd"
# LLM inference in C/C++
brew "llama.cpp"
# Apple Silicon Monitor Top written in Golang
brew "mactop"
# Mac App Store command-line interface
brew "mas"
# Media player based on MPlayer and mplayer2
brew "mpv"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Port scanning utility for large networks
brew "nmap"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Platform built on V8 to build network applications
brew "node"
# Package for scientific computing with Python
brew "numpy"
# Manage multiple Node.js versions
brew "nvm"
# HTTP load generator, inspired by rakyll/hey with tui animation
brew "oha"
# Provides a software solution to manage, store, and distribute sensitive data
brew "openbao"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Convert PDFs to images
brew "pdf2image"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@16"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Implementation of Python 3 in Python
brew "pypy3.10"
# Persistent key-value database, with built-in net interface
brew "redis"
# Pack repository contents into a single AI-friendly file
brew "repomix"
# Diff filter highlighting which line parts have changed
brew "riff"
# Parallel S3 and local filesystem execution tool
brew "s5cmd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Terminal based presentation tool
brew "slides"
# Version control system designed to be a better CVS
brew "subversion"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Markup-based typesetting system
brew "typst"
# Beautiful and reliable typst code formatter
brew "typstyle"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Syntax-aware linter for prose
brew "vale"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Convert HTML to PDF
brew "weasyprint"
# Command-line tool to help build, run, and test web extensions
brew "web-ext"
# Command-line streaming torrent client
brew "webtorrent-cli"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Permanent TouchID support for sudo
brew "artginzburg/tap/sudo-touchid"
# Software to interact with Atlassian Cloud from the terminal
brew "atlassian/acli/acli"
# EC2 Instance Selector is a tool to filter EC2 instance types based on resource criteria
brew "aws/tap/ec2-instance-selector"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Smart calculator
brew "nikolaeu/numi/numi-cli"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Command-line interface for 1Password
cask "1password-cli"
# Password manager
cask "1password@beta"
# Privacy-focused app for managing your finances
cask "actual"
# Application to indicate the aerospace workspace
cask "aeroindicator"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Open-source KVM software
cask "barrier"
# E-books management software
cask "calibre"
# Anthropic's official Claude AI desktop app
cask "claude"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# Desktop client for Ente Auth
cask "ente-auth"
# Web browser
cask "firefox@beta"
# Screenshot software
cask "flameshot"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# GitHub notifications on your menu bar
cask "gitify"
# Web browser
cask "google-chrome@beta"
# Open-source video transcoder
cask "handbrake-app"
# Free and open-source media player
cask "iina"
# Jellyfin desktop client
cask "jellyfin-media-player"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source screen recorder built with web technology
cask "kap"
# Keyboard customiser
cask "karabiner-elements"
# Preview and audit Kindle eBooks
cask "kindle-previewer"
# Discover, download, and run local LLMs
cask "lm-studio"
# Extensible two-pane file manager
cask "marta"
# Sandbox construction video game
cask "minecraft"
# Web browser focused on privacy and on minimizing tracking and fingerprinting
cask "mullvad-browser"
# VPN client
cask "mullvad-vpn@beta"
# Neovim Client
cask "neovide-app"
# Free and open-source RSS reader
cask "netnewswire@beta"
# Calendar for professionals and teams
cask "notion-calendar"
# Calculator and converter application
cask "numi"
# Replacement for Docker Desktop
cask "orbstack"
# Rhythm game
cask "osu"
# VPN client focusing on security
cask "protonvpn"
# Archive manager for data compression and backups
cask "rar"
# Control your tools with a few keystrokes
cask "raycast"
# Open source virtual/remote desktop application
cask "rustdesk"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Screenshot measurement and annotation tool
cask "shottr"
# Team communication and collaboration software
cask "slack@beta"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# To-do list
cask "todoist-app"
# Web browser focusing on security
cask "tor-browser"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
# Network protocol analyzer
cask "wireshark-app"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Balatro", id: 6502451661
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "Grila", id: 6444335028
mas "iMovie", id: 408981434
mas "JapaneseLife", id: 1634749545
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "Sasquatch", id: 1465346522
mas "Save to Reader", id: 1640236961
mas "Shareful", id: 1522267256
mas "UTC Time", id: 1538245904
mas "Xcode", id: 497799835
vscode "antfu.icons-carbon"
vscode "asvetliakov.vscode-neovim"
vscode "cdonohue.quill-icons"
vscode "charliermarsh.ruff"
vscode "codeium.codeium"
vscode "continue.continue"
vscode "datadog.datadog-vscode"
vscode "dorianmassoulier.repomix-runner"
vscode "eamodio.gitlens"
vscode "ggml-org.llama-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "grafana.vscode-jsonnet"
vscode "hashicorp.terraform"
vscode "jdinhlife.gruvbox"
vscode "jjk.jjk"
vscode "joaopalmeiro.icons-octicons"
vscode "jonathanharty.gruvbox-material-icon-theme"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "naumovs.color-highlight"
vscode "rooveterinaryinc.roo-cline"
vscode "sainnhe.gruvbox-material"
vscode "saoudrizwan.claude-dev"
vscode "sumneko.lua"
vscode "supermaven.supermaven"
vscode "tomphilbin.gruvbox-themes"
vscode "vscodevim.vim"
